Microchip-MPLAB-Harmony/csp/apps/afec/afec_user_sequence/firmware/src/packs/ATSAMV71Q21B_DFP/component/pio.h
/* -------- PIO_DRIVER : (PIO Offset: 0x118) (R/W 32) I/O Drive Register -------- */
#define PIO_DRIVER_LINE0_Pos                  _U_(0)                                               /**< (PIO_DRIVER) Drive of PIO Line 0 Position */
#define PIO_DRIVER_LINE0_Msk                  (_U_(0x1) << PIO_DRIVER_LINE0_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 0 Mask */
#define PIO_DRIVER_LINE0(value)               (PIO_DRIVER_LINE0_Msk & ((value) << PIO_DRIVER_LINE0_Pos))
#define   PIO_DRIVER_LINE0_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE0_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE0_LOW_DRIVE            (PIO_DRIVER_LINE0_LOW_DRIVE_Val << PIO_DRIVER_LINE0_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE0_HIGH_DRIVE           (PIO_DRIVER_LINE0_HIGH_DRIVE_Val << PIO_DRIVER_LINE0_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE1_Pos                  _U_(1)                                               /**< (PIO_DRIVER) Drive of PIO Line 1 Position */
#define PIO_DRIVER_LINE1_Msk                  (_U_(0x1) << PIO_DRIVER_LINE1_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 1 Mask */
#define PIO_DRIVER_LINE1(value)               (PIO_DRIVER_LINE1_Msk & ((value) << PIO_DRIVER_LINE1_Pos))
#define   PIO_DRIVER_LINE1_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE1_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE1_LOW_DRIVE            (PIO_DRIVER_LINE1_LOW_DRIVE_Val << PIO_DRIVER_LINE1_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE1_HIGH_DRIVE           (PIO_DRIVER_LINE1_HIGH_DRIVE_Val << PIO_DRIVER_LINE1_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE2_Pos                  _U_(2)                                               /**< (PIO_DRIVER) Drive of PIO Line 2 Position */
#define PIO_DRIVER_LINE2_Msk                  (_U_(0x1) << PIO_DRIVER_LINE2_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 2 Mask */
#define PIO_DRIVER_LINE2(value)               (PIO_DRIVER_LINE2_Msk & ((value) << PIO_DRIVER_LINE2_Pos))
#define   PIO_DRIVER_LINE2_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE2_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE2_LOW_DRIVE            (PIO_DRIVER_LINE2_LOW_DRIVE_Val << PIO_DRIVER_LINE2_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE2_HIGH_DRIVE           (PIO_DRIVER_LINE2_HIGH_DRIVE_Val << PIO_DRIVER_LINE2_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE3_Pos                  _U_(3)                                               /**< (PIO_DRIVER) Drive of PIO Line 3 Position */
#define PIO_DRIVER_LINE3_Msk                  (_U_(0x1) << PIO_DRIVER_LINE3_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 3 Mask */
#define PIO_DRIVER_LINE3(value)               (PIO_DRIVER_LINE3_Msk & ((value) << PIO_DRIVER_LINE3_Pos))
#define   PIO_DRIVER_LINE3_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE3_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE3_LOW_DRIVE            (PIO_DRIVER_LINE3_LOW_DRIVE_Val << PIO_DRIVER_LINE3_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE3_HIGH_DRIVE           (PIO_DRIVER_LINE3_HIGH_DRIVE_Val << PIO_DRIVER_LINE3_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE4_Pos                  _U_(4)                                               /**< (PIO_DRIVER) Drive of PIO Line 4 Position */
#define PIO_DRIVER_LINE4_Msk                  (_U_(0x1) << PIO_DRIVER_LINE4_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 4 Mask */
#define PIO_DRIVER_LINE4(value)               (PIO_DRIVER_LINE4_Msk & ((value) << PIO_DRIVER_LINE4_Pos))
#define   PIO_DRIVER_LINE4_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE4_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE4_LOW_DRIVE            (PIO_DRIVER_LINE4_LOW_DRIVE_Val << PIO_DRIVER_LINE4_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE4_HIGH_DRIVE           (PIO_DRIVER_LINE4_HIGH_DRIVE_Val << PIO_DRIVER_LINE4_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE5_Pos                  _U_(5)                                               /**< (PIO_DRIVER) Drive of PIO Line 5 Position */
#define PIO_DRIVER_LINE5_Msk                  (_U_(0x1) << PIO_DRIVER_LINE5_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 5 Mask */
#define PIO_DRIVER_LINE5(value)               (PIO_DRIVER_LINE5_Msk & ((value) << PIO_DRIVER_LINE5_Pos))
#define   PIO_DRIVER_LINE5_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE5_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE5_LOW_DRIVE            (PIO_DRIVER_LINE5_LOW_DRIVE_Val << PIO_DRIVER_LINE5_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE5_HIGH_DRIVE           (PIO_DRIVER_LINE5_HIGH_DRIVE_Val << PIO_DRIVER_LINE5_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE6_Pos                  _U_(6)                                               /**< (PIO_DRIVER) Drive of PIO Line 6 Position */
#define PIO_DRIVER_LINE6_Msk                  (_U_(0x1) << PIO_DRIVER_LINE6_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 6 Mask */
#define PIO_DRIVER_LINE6(value)               (PIO_DRIVER_LINE6_Msk & ((value) << PIO_DRIVER_LINE6_Pos))
#define   PIO_DRIVER_LINE6_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE6_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE6_LOW_DRIVE            (PIO_DRIVER_LINE6_LOW_DRIVE_Val << PIO_DRIVER_LINE6_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE6_HIGH_DRIVE           (PIO_DRIVER_LINE6_HIGH_DRIVE_Val << PIO_DRIVER_LINE6_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE7_Pos                  _U_(7)                                               /**< (PIO_DRIVER) Drive of PIO Line 7 Position */
#define PIO_DRIVER_LINE7_Msk                  (_U_(0x1) << PIO_DRIVER_LINE7_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 7 Mask */
#define PIO_DRIVER_LINE7(value)               (PIO_DRIVER_LINE7_Msk & ((value) << PIO_DRIVER_LINE7_Pos))
#define   PIO_DRIVER_LINE7_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE7_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE7_LOW_DRIVE            (PIO_DRIVER_LINE7_LOW_DRIVE_Val << PIO_DRIVER_LINE7_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE7_HIGH_DRIVE           (PIO_DRIVER_LINE7_HIGH_DRIVE_Val << PIO_DRIVER_LINE7_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE8_Pos                  _U_(8)                                               /**< (PIO_DRIVER) Drive of PIO Line 8 Position */
#define PIO_DRIVER_LINE8_Msk                  (_U_(0x1) << PIO_DRIVER_LINE8_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 8 Mask */
#define PIO_DRIVER_LINE8(value)               (PIO_DRIVER_LINE8_Msk & ((value) << PIO_DRIVER_LINE8_Pos))
#define   PIO_DRIVER_LINE8_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE8_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE8_LOW_DRIVE            (PIO_DRIVER_LINE8_LOW_DRIVE_Val << PIO_DRIVER_LINE8_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE8_HIGH_DRIVE           (PIO_DRIVER_LINE8_HIGH_DRIVE_Val << PIO_DRIVER_LINE8_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE9_Pos                  _U_(9)                                               /**< (PIO_DRIVER) Drive of PIO Line 9 Position */
#define PIO_DRIVER_LINE9_Msk                  (_U_(0x1) << PIO_DRIVER_LINE9_Pos)                   /**< (PIO_DRIVER) Drive of PIO Line 9 Mask */
#define PIO_DRIVER_LINE9(value)               (PIO_DRIVER_LINE9_Msk & ((value) << PIO_DRIVER_LINE9_Pos))
#define   PIO_DRIVER_LINE9_LOW_DRIVE_Val      _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE9_HIGH_DRIVE_Val     _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE9_LOW_DRIVE            (PIO_DRIVER_LINE9_LOW_DRIVE_Val << PIO_DRIVER_LINE9_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE9_HIGH_DRIVE           (PIO_DRIVER_LINE9_HIGH_DRIVE_Val << PIO_DRIVER_LINE9_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE10_Pos                 _U_(10)                                              /**< (PIO_DRIVER) Drive of PIO Line 10 Position */
#define PIO_DRIVER_LINE10_Msk                 (_U_(0x1) << PIO_DRIVER_LINE10_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 10 Mask */
#define PIO_DRIVER_LINE10(value)              (PIO_DRIVER_LINE10_Msk & ((value) << PIO_DRIVER_LINE10_Pos))
#define   PIO_DRIVER_LINE10_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE10_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE10_LOW_DRIVE           (PIO_DRIVER_LINE10_LOW_DRIVE_Val << PIO_DRIVER_LINE10_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE10_HIGH_DRIVE          (PIO_DRIVER_LINE10_HIGH_DRIVE_Val << PIO_DRIVER_LINE10_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE11_Pos                 _U_(11)                                              /**< (PIO_DRIVER) Drive of PIO Line 11 Position */
#define PIO_DRIVER_LINE11_Msk                 (_U_(0x1) << PIO_DRIVER_LINE11_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 11 Mask */
#define PIO_DRIVER_LINE11(value)              (PIO_DRIVER_LINE11_Msk & ((value) << PIO_DRIVER_LINE11_Pos))
#define   PIO_DRIVER_LINE11_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE11_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE11_LOW_DRIVE           (PIO_DRIVER_LINE11_LOW_DRIVE_Val << PIO_DRIVER_LINE11_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE11_HIGH_DRIVE          (PIO_DRIVER_LINE11_HIGH_DRIVE_Val << PIO_DRIVER_LINE11_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE12_Pos                 _U_(12)                                              /**< (PIO_DRIVER) Drive of PIO Line 12 Position */
#define PIO_DRIVER_LINE12_Msk                 (_U_(0x1) << PIO_DRIVER_LINE12_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 12 Mask */
#define PIO_DRIVER_LINE12(value)              (PIO_DRIVER_LINE12_Msk & ((value) << PIO_DRIVER_LINE12_Pos))
#define   PIO_DRIVER_LINE12_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE12_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE12_LOW_DRIVE           (PIO_DRIVER_LINE12_LOW_DRIVE_Val << PIO_DRIVER_LINE12_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE12_HIGH_DRIVE          (PIO_DRIVER_LINE12_HIGH_DRIVE_Val << PIO_DRIVER_LINE12_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE13_Pos                 _U_(13)                                              /**< (PIO_DRIVER) Drive of PIO Line 13 Position */
#define PIO_DRIVER_LINE13_Msk                 (_U_(0x1) << PIO_DRIVER_LINE13_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 13 Mask */
#define PIO_DRIVER_LINE13(value)              (PIO_DRIVER_LINE13_Msk & ((value) << PIO_DRIVER_LINE13_Pos))
#define   PIO_DRIVER_LINE13_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE13_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE13_LOW_DRIVE           (PIO_DRIVER_LINE13_LOW_DRIVE_Val << PIO_DRIVER_LINE13_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE13_HIGH_DRIVE          (PIO_DRIVER_LINE13_HIGH_DRIVE_Val << PIO_DRIVER_LINE13_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE14_Pos                 _U_(14)                                              /**< (PIO_DRIVER) Drive of PIO Line 14 Position */
#define PIO_DRIVER_LINE14_Msk                 (_U_(0x1) << PIO_DRIVER_LINE14_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 14 Mask */
#define PIO_DRIVER_LINE14(value)              (PIO_DRIVER_LINE14_Msk & ((value) << PIO_DRIVER_LINE14_Pos))
#define   PIO_DRIVER_LINE14_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE14_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE14_LOW_DRIVE           (PIO_DRIVER_LINE14_LOW_DRIVE_Val << PIO_DRIVER_LINE14_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE14_HIGH_DRIVE          (PIO_DRIVER_LINE14_HIGH_DRIVE_Val << PIO_DRIVER_LINE14_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE15_Pos                 _U_(15)                                              /**< (PIO_DRIVER) Drive of PIO Line 15 Position */
#define PIO_DRIVER_LINE15_Msk                 (_U_(0x1) << PIO_DRIVER_LINE15_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 15 Mask */
#define PIO_DRIVER_LINE15(value)              (PIO_DRIVER_LINE15_Msk & ((value) << PIO_DRIVER_LINE15_Pos))
#define   PIO_DRIVER_LINE15_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE15_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE15_LOW_DRIVE           (PIO_DRIVER_LINE15_LOW_DRIVE_Val << PIO_DRIVER_LINE15_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE15_HIGH_DRIVE          (PIO_DRIVER_LINE15_HIGH_DRIVE_Val << PIO_DRIVER_LINE15_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE16_Pos                 _U_(16)                                              /**< (PIO_DRIVER) Drive of PIO Line 16 Position */
#define PIO_DRIVER_LINE16_Msk                 (_U_(0x1) << PIO_DRIVER_LINE16_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 16 Mask */
#define PIO_DRIVER_LINE16(value)              (PIO_DRIVER_LINE16_Msk & ((value) << PIO_DRIVER_LINE16_Pos))
#define   PIO_DRIVER_LINE16_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE16_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE16_LOW_DRIVE           (PIO_DRIVER_LINE16_LOW_DRIVE_Val << PIO_DRIVER_LINE16_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE16_HIGH_DRIVE          (PIO_DRIVER_LINE16_HIGH_DRIVE_Val << PIO_DRIVER_LINE16_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE17_Pos                 _U_(17)                                              /**< (PIO_DRIVER) Drive of PIO Line 17 Position */
#define PIO_DRIVER_LINE17_Msk                 (_U_(0x1) << PIO_DRIVER_LINE17_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 17 Mask */
#define PIO_DRIVER_LINE17(value)              (PIO_DRIVER_LINE17_Msk & ((value) << PIO_DRIVER_LINE17_Pos))
#define   PIO_DRIVER_LINE17_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE17_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE17_LOW_DRIVE           (PIO_DRIVER_LINE17_LOW_DRIVE_Val << PIO_DRIVER_LINE17_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE17_HIGH_DRIVE          (PIO_DRIVER_LINE17_HIGH_DRIVE_Val << PIO_DRIVER_LINE17_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE18_Pos                 _U_(18)                                              /**< (PIO_DRIVER) Drive of PIO Line 18 Position */
#define PIO_DRIVER_LINE18_Msk                 (_U_(0x1) << PIO_DRIVER_LINE18_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 18 Mask */
#define PIO_DRIVER_LINE18(value)              (PIO_DRIVER_LINE18_Msk & ((value) << PIO_DRIVER_LINE18_Pos))
#define   PIO_DRIVER_LINE18_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE18_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE18_LOW_DRIVE           (PIO_DRIVER_LINE18_LOW_DRIVE_Val << PIO_DRIVER_LINE18_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE18_HIGH_DRIVE          (PIO_DRIVER_LINE18_HIGH_DRIVE_Val << PIO_DRIVER_LINE18_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE19_Pos                 _U_(19)                                              /**< (PIO_DRIVER) Drive of PIO Line 19 Position */
#define PIO_DRIVER_LINE19_Msk                 (_U_(0x1) << PIO_DRIVER_LINE19_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 19 Mask */
#define PIO_DRIVER_LINE19(value)              (PIO_DRIVER_LINE19_Msk & ((value) << PIO_DRIVER_LINE19_Pos))
#define   PIO_DRIVER_LINE19_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE19_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE19_LOW_DRIVE           (PIO_DRIVER_LINE19_LOW_DRIVE_Val << PIO_DRIVER_LINE19_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE19_HIGH_DRIVE          (PIO_DRIVER_LINE19_HIGH_DRIVE_Val << PIO_DRIVER_LINE19_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE20_Pos                 _U_(20)                                              /**< (PIO_DRIVER) Drive of PIO Line 20 Position */
#define PIO_DRIVER_LINE20_Msk                 (_U_(0x1) << PIO_DRIVER_LINE20_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 20 Mask */
#define PIO_DRIVER_LINE20(value)              (PIO_DRIVER_LINE20_Msk & ((value) << PIO_DRIVER_LINE20_Pos))
#define   PIO_DRIVER_LINE20_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE20_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE20_LOW_DRIVE           (PIO_DRIVER_LINE20_LOW_DRIVE_Val << PIO_DRIVER_LINE20_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE20_HIGH_DRIVE          (PIO_DRIVER_LINE20_HIGH_DRIVE_Val << PIO_DRIVER_LINE20_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE21_Pos                 _U_(21)                                              /**< (PIO_DRIVER) Drive of PIO Line 21 Position */
#define PIO_DRIVER_LINE21_Msk                 (_U_(0x1) << PIO_DRIVER_LINE21_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 21 Mask */
#define PIO_DRIVER_LINE21(value)              (PIO_DRIVER_LINE21_Msk & ((value) << PIO_DRIVER_LINE21_Pos))
#define   PIO_DRIVER_LINE21_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE21_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE21_LOW_DRIVE           (PIO_DRIVER_LINE21_LOW_DRIVE_Val << PIO_DRIVER_LINE21_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE21_HIGH_DRIVE          (PIO_DRIVER_LINE21_HIGH_DRIVE_Val << PIO_DRIVER_LINE21_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE22_Pos                 _U_(22)                                              /**< (PIO_DRIVER) Drive of PIO Line 22 Position */
#define PIO_DRIVER_LINE22_Msk                 (_U_(0x1) << PIO_DRIVER_LINE22_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 22 Mask */
#define PIO_DRIVER_LINE22(value)              (PIO_DRIVER_LINE22_Msk & ((value) << PIO_DRIVER_LINE22_Pos))
#define   PIO_DRIVER_LINE22_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE22_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE22_LOW_DRIVE           (PIO_DRIVER_LINE22_LOW_DRIVE_Val << PIO_DRIVER_LINE22_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE22_HIGH_DRIVE          (PIO_DRIVER_LINE22_HIGH_DRIVE_Val << PIO_DRIVER_LINE22_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE23_Pos                 _U_(23)                                              /**< (PIO_DRIVER) Drive of PIO Line 23 Position */
#define PIO_DRIVER_LINE23_Msk                 (_U_(0x1) << PIO_DRIVER_LINE23_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 23 Mask */
#define PIO_DRIVER_LINE23(value)              (PIO_DRIVER_LINE23_Msk & ((value) << PIO_DRIVER_LINE23_Pos))
#define   PIO_DRIVER_LINE23_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE23_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE23_LOW_DRIVE           (PIO_DRIVER_LINE23_LOW_DRIVE_Val << PIO_DRIVER_LINE23_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE23_HIGH_DRIVE          (PIO_DRIVER_LINE23_HIGH_DRIVE_Val << PIO_DRIVER_LINE23_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE24_Pos                 _U_(24)                                              /**< (PIO_DRIVER) Drive of PIO Line 24 Position */
#define PIO_DRIVER_LINE24_Msk                 (_U_(0x1) << PIO_DRIVER_LINE24_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 24 Mask */
#define PIO_DRIVER_LINE24(value)              (PIO_DRIVER_LINE24_Msk & ((value) << PIO_DRIVER_LINE24_Pos))
#define   PIO_DRIVER_LINE24_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
